In [1]:
%load_ext sql

## RIGHT JOIN (or RIGHT OUTER JOIN):

-- Retrieves all rows from the right table and the matched rows from the left table.
-- If no match is found in the left table, NULL values are returned.

In [2]:
%%sql mysql://root:redhat@localhost:3306/mydb
select * from cus;

8 rows affected.

[(1, 'Rajesh Sharma', 32, 'Mumbai, India', 103),
 (2, 'Sneha Kapoor', 28, 'Delhi, India', 102),
 (3, 'Amit Singh', 35, 'Bangalore, India', 104),
 (4, 'Priya Patel', None, 'Kolkata, India', 101),
 (5, 'Neha Verma', 29, 'Chennai, India', 105),
 (6, None, 38, 'Hyderabad, India', 101),
 (7, 'Pooja Reddy', 24, 'Pune, India', None),
 (8, 'Arun Kumar', 31, 'Jaipur, India', None)]

In [3]:
%%sql mysql://root:redhat@localhost:3306/mydb
select * from pro;

6 rows affected.

[(101, 'Laptop', 999, 'In Stock'),
 (102, 'Smartphone', 499, 'Out of Stock'),
 (103, 'Headphones', 79, 'In Stock'),
 (104, 'Tablet', 349, 'In Stock'),
 (105, 'Desktop Computer', 1199, 'In Stock'),
 (106, 'Wireless Mouse', 29, 'In Stock')]

In [4]:
%%sql mysql://root:redhat@localhost:3306/mydb
Select * from cus right join pro on Cus.purchase_id =pro.pro_id;

7 rows affected.

[(6, None, 38, 'Hyderabad, India', 101, 101, 'Laptop', 999, 'In Stock'),
 (4, 'Priya Patel', None, 'Kolkata, India', 101, 101, 'Laptop', 999, 'In Stock'),
 (2, 'Sneha Kapoor', 28, 'Delhi, India', 102, 102, 'Smartphone', 499, 'Out of Stock'),
 (1, 'Rajesh Sharma', 32, 'Mumbai, India', 103, 103, 'Headphones', 79, 'In Stock'),
 (3, 'Amit Singh', 35, 'Bangalore, India', 104, 104, 'Tablet', 349, 'In Stock'),
 (5, 'Neha Verma', 29, 'Chennai, India', 105, 105, 'Desktop Computer', 1199, 'In Stock'),
 (None, None, None, None, None, 106, 'Wireless Mouse', 29, 'In Stock')]